import { StoryLine } from "../types/story"

export const storyData: StoryLine[] = [
  {
    type: "narration",
    text: "옛날 옛날, 착한 소녀 신데렐라가 살았습니다. 신데렐라는 어린 시절 어머니를 잃고 아버지와 새어머니, 두 언니와 함께 살게 되었습니다. 그러나 곧 아버지마저 돌아가시게 되었어요.",
  }, // audio: 0.mp3
  {
    type: "narration",
    text: "새엄마는 아름답고 마음이 고운 신데렐라와 자신의 두 딸이 비교가 된다는 이유로 신데렐라를 미워하고 구박했습니다. 새엄마와 다른 가족들은 모두 잘 꾸며진 집에서 지냈지만 신데렐라는 볼품없는 다락방의 초라한 침대에서 밤을 보내야만 했어요.",
  }, // audio: 1.mp3
  {
    type: "narration",
    text: "신데렐라는 그 모든 어려움 속에서도 꿋꿋이 견디며 밝은 모습으로 살아가고 있었습니다. 어느 날, 성에서 무도회가 열린다는 소식이 들려왔습니다. 신데렐라의 두 언니들은 신이 나서 정신없이 자신들을 부각시켜줄 드레스와 장식품을 몸에 걸쳐 보기 바빴습니다.",
  }, // audio: 2.mp3
  {
    type: "bigsis2",
    text: '"나는 장식이 있는 부드럽고 풍성한 붉은 색 드레스를 입고 갈 테야."',
  }, // audio: 3.mp3
  {
    type: "bigsis1",
    text: '"그럼 난 금빛 꽃무늬가 더해진 숄과 보석 장신구로 치장해야겠어."',
  }, // audio: 4.mp3
  {
    type: "narration",
    text: "신데렐라는 며칠간 그런 언니들의 치장을 묵묵히 도왔습니다. 무도회 당일, 언니들은 갖가지 장신구를 걸치고는 물었습니다.",
  }, // audio: 5.mp3
  {
    type: "hero1",
    text: "신데렐라야. 너는 왜 그 무도회에 가지 않니?",
  }, // audio: 6.mp3
  {
    type: "hero2",
    text: "저는 언니들과 다르니 그런 곳에 갈 수 없는걸요.",
  }, // audio: 7.mp3
  {
    type: "hero1",
    text: "하긴, 네가 거기 갔다간 사람들이 죄다 널 숯덩이라 놀리겠지?",
  }, // audio: 8.mp3
  {
    type: "narration",
    text: "두 언니는 웃음을 터뜨리며 신데렐라를 놀렸습니다.",
  }, // audio: 9.mp3
]
